In [27]:
import pandas as pd
import openpyxl as xl

In [4]:
# Tes DATA
data = pd.read_csv('./data.csv', sep=';')
data.head()

   Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Unnamed: 4
0  Andi              80         70         90         NaN
1  Budi              90         80         70         NaN
2  Caca              70         90         80         NaN
3  Dedi              60         80         90         NaN
4  Euis              50         70         80         NaN

In [5]:
# Soal No. 2
dataList = data.iloc[:, :-1]
dataList['Nilai Akhir'] = dataList['Nilai Formatif'] * 0.3 + dataList['Nilai UTS'] * 0.3 + dataList['Nilai UAS'] * 0.4
dataList

       Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir
0      Andi              80         70         90         81.0
1      Budi              90         80         70         79.0
2      Caca              70         90         80         80.0
3      Dedi              60         80         90         78.0
4      Euis              50         70         80         68.0
5      Fafa              40         60         70         58.0
6      Gigi              30         50         60         48.0
7      Haha              20         40         50         38.0
8      Iwan              10         30         40         28.0
9      Joko               0         20         30         18.0
10    Riyan              98         70         60         74.4
11    Alfin              80         70         90         81.0
12    Rizky              90         80         70         79.0
13    Rizal              70         90         80         80.0
14  Maulana              60         80         90         78.0

In [15]:
# Soal No. 1
# 5 peringkat terbawah
peringkatBawah = dataList.sort_values(by=['Nilai Akhir']).head()
peringkatBawah

   Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir
9  Joko               0         20         30         18.0
8  Iwan              10         30         40         28.0
7  Haha              20         40         50         38.0
6  Gigi              30         50         60         48.0
5  Fafa              40         60         70         58.0

In [14]:
# Soal No. 1
# 5 peringkat teratas
peringkatAtas = dataList.sort_values(by=['Nilai Akhir'], ascending=False).head()
peringkatAtas

     Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir
0    Andi              80         70         90         81.0
11  Alfin              80         70         90         81.0
2    Caca              70         90         80         80.0
13  Rizal              70         90         80         80.0
1    Budi              90         80         70         79.0

In [16]:
# Soal No. 3
rataRata = dataList[['Nilai Formatif', 'Nilai UTS', 'Nilai UAS']].mean()
rataRata

Nilai Formatif    56.533333
Nilai UTS         65.333333
Nilai UAS         70.000000
dtype: float64

In [10]:
# Soal No. 4
# Nilai akhir tertinggi
nilaiAkhirTertinggi = dataList.sort_values(by=['Nilai Akhir'], ascending=False).head(1)
nilaiAkhirTertinggi

   Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir
0  Andi              80         70         90         81.0

In [11]:
# Soal No. 4
# Nilai akhir terendah
nilaiAkhirTerendah = dataList.sort_values(by=['Nilai Akhir']).head(1)
nilaiAkhirTerendah

   Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir
9  Joko               0         20         30         18.0

In [17]:
# Soal No. 6
# Tampilkan semua siswa yang memiliki nilai akhir > 80
nilaiAkhirTinggi = dataList[dataList['Nilai Akhir'] > 80]
nilaiAkhirTinggi

     Nama  Nilai Formatif  Nilai UTS  Nilai UAS  Nilai Akhir
0    Andi              80         70         90         81.0
11  Alfin              80         70         90         81.0

In [28]:
#Soal No. 8
# Export hasil data.csv kedalam bentuk excel!
dataList.to_excel('./data.xlsx', index=False)